In [1]:
import numpy as np
import pandas as pd

<b>DataFrame</b> - двумерная структура данных библиотеки Pandas

Создадим DataFrame:

In [2]:
df = pd.DataFrame({'Col1':['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'],
                   'Col2':[1, 3, 5, 7, 9, 11, 13, 15]}, columns=['Col1', 'Col2'])

In [3]:
df

  Col1  Col2
0    a     1
1    b     3
2    c     5
3    d     7
4    e     9
5    f    11
6    g    13
7    h    15

#### Просмотр информации о DataFrame

In [4]:
df.shape

(8, 2)

In [5]:
df.columns

Index(['Col1', 'Col2'], dtype='object')

In [6]:
df.index

RangeIndex(start=0, stop=8, step=1)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Col1    8 non-null      object
 1   Col2    8 non-null      int64
dtypes: int64(1), object(1)
memory usage: 256.0+ bytes

In [8]:
df.describe()

            Col2
count   8.000000
mean    8.000000
std     4.898979
min     1.000000
25%     4.500000
50%     8.000000
75%    11.500000
max    15.000000

In [9]:
df.head()

  Col1  Col2
0    a     1
1    b     3
2    c     5
3    d     7
4    e     9

In [10]:
df.head(2)

  Col1  Col2
0    a     1
1    b     3

In [12]:
df['Col1'].head()

0    a
1    b
2    c
3    d
4    e
Name: Col1, dtype: object

In [14]:
df.Col1.head()

0    a
1    b
2    c
3    d
4    e
Name: Col1, dtype: object

In [15]:
df.tail()

  Col1  Col2
3    d     7
4    e     9
5    f    11
6    g    13
7    h    15

#### Изменение индекса

In [16]:
df.index = [2, 4, 6, 8, 10, 12, 14, 16]

In [17]:
df

   Col1  Col2
2     a     1
4     b     3
6     c     5
8     d     7
10    e     9
12    f    11
14    g    13
16    h    15

#### Выбор данных по инексу

In [18]:
df.loc[2, 'Col1']

'a'

In [19]:
df.loc[2, :]

Col1    a
Col2    1
Name: 2, dtype: object

In [21]:
df.loc[2:4, :]

  Col1  Col2
2    a     1
4    b     3

In [22]:
df

   Col1  Col2
2     a     1
4     b     3
6     c     5
8     d     7
10    e     9
12    f    11
14    g    13
16    h    15

In [24]:
df.iloc[0, :]

Col1    a
Col2    1
Name: 2, dtype: object

In [25]:
df.iloc[0:2, :]

  Col1  Col2
2    a     1
4    b     3

In [27]:
df.iloc[0:2, 0]

2    a
4    b
Name: Col1, dtype: object

#### Выбор по условию

In [28]:
df.loc[df['Col1'] == 'b', :]

  Col1  Col2
4    b     3

In [29]:
df.loc[df['Col1'] == 'b', 'Col2']

4    3
Name: Col2, dtype: int64

In [30]:
df.loc[df['Col1'] == 'b', 'Col2'].values

array([3], dtype=int64)

In [33]:
df.loc[df['Col2'] > 10, 'Col1']

12    f
14    g
16    h
Name: Col1, dtype: object

In [34]:
df.loc[(df['Col2'] > 10) & (df['Col1'] != 'g'), :]

   Col1  Col2
12    f    11
16    h    15

In [35]:
df.loc[(df['Col2'] > 10) | (df['Col2'] % 9 == 0), :]

   Col1  Col2
10    e     9
12    f    11
14    g    13
16    h    15

In [36]:
df.loc[df['Col2'].between(11, 13), :]

   Col1  Col2
12    f    11
14    g    13

In [37]:
df.loc[df['Col1'].isin(['a', 'b', 'c', 'd', 'e']), :]

   Col1  Col2
2     a     1
4     b     3
6     c     5
8     d     7
10    e     9

In [38]:
df.loc[~df['Col1'].isin(['a', 'b', 'c', 'd', 'e']), :]

   Col1  Col2
12    f    11
14    g    13
16    h    15

In [39]:
df

   Col1  Col2
2     a     1
4     b     3
6     c     5
8     d     7
10    e     9
12    f    11
14    g    13
16    h    15

In [42]:
df.query('Col1 == "b"')

  Col1  Col2
4    b     3

In [43]:
df.query('Col2  >  10')

   Col1  Col2
12    f    11
14    g    13
16    h    15

#### Столбец DataFrame в виде Series

In [44]:
s = df['Col1']

In [45]:
s

2     a
4     b
6     c
8     d
10    e
12    f
14    g
16    h
Name: Col1, dtype: object

In [46]:
type(s)

pandas.core.series.Series

In [47]:
df2 =  pd.DataFrame(s)
df2

   Col1
2     a
4     b
6     c
8     d
10    e
12    f
14    g
16    h

In [48]:
df_copy =  df.copy()

In [49]:
df_copy

   Col1  Col2
2     a     1
4     b     3
6     c     5
8     d     7
10    e     9
12    f    11
14    g    13
16    h    15

#### Случайный выбор n-го количества строк

In [50]:
df.sample(n = 2)

   Col1  Col2
12    f    11
10    e     9

#### Случайный выбор доли от исходного датафрейма

In [51]:
df.sample(frac = 0.5)

   Col1  Col2
6     c     5
8     d     7
2     a     1
10    e     9

#### Случайный выбор с возвращением (строки могут повторяться)

In [52]:
df.sample(frac = 0.5, replace = True)

   Col1  Col2
16    h    15
10    e     9
10    e     9
10    e     9

#### Случайное перемешивание

In [53]:
# random_state - Для воспроизводимости перемешивание
df.sample(frac = 1.0, random_state=42)

   Col1  Col2
4     b     3
12    f    11
2     a     1
16    h    15
6     c     5
10    e     9
8     d     7
14    g    13

#### Запись и чтение DataFrame в csv

In [54]:
df.to_csv('Test.csv', sep = ';', index = False)

In [55]:
df_new = pd.read_csv('Test.csv', sep = ';')

In [57]:
df_new

  Col1  Col2
0    a     1
1    b     3
2    c     5
3    d     7
4    e     9
5    f    11
6    g    13
7    h    15

(Запись в excel и pickle - c помощью методов to_excel, to_pickle. Чтение - read_excel, read_pickle)